app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` ORDER BY last_name asc LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.all.paginate(:page => params[:page]).order([sort_column, sort_direction].join(" "))